# data-database-types-relational-language-SQL-MySQL-C_R_UD-read-command-SELECT-WHERE-operator-IN
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **determine** if a **specified** **value** **matches** **any** **value** **in** a **set** of **values** or returned by a subquery [1]

```sql
mysql> use lab1;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab1 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

- returned rows - records - tuples - from columns - attributes - fields - personID - name - clause - WHERE - column - attribute - field - age - value is age 12 or 13 or 14 or 15 - **operator** - **OR** - **verbose** - **operator** - **IN** - **better** for **readability** [1]

```sql
mysql> SELECT personID,name
    -> FROM person
    -> WHERE age=12
    -> OR age=13
    -> OR age=14
    -> OR age=15;
+----------+-------+
| personID | name  |
+----------+-------+
|        3 | Mary  |
|        4 | Alan  |
|        7 | Shane |
+----------+-------+
3 rows in set (0.00 sec)
```

```sql
mysql> SELECT personID,name
    -> FROM person
    -> WHERE age IN
    -> (12,13,14,15);
+----------+-------+
| personID | name  |
+----------+-------+
|        3 | Mary  |
|        4 | Alan  |
|        7 | Shane |
+----------+-------+
3 rows in set (0.00 sec)
```

***
# END